# Используем образ Node.js версии 20.0.0 в качестве базового образа
FROM node:20.0.0

# Устанавливаем рабочую директорию контейнера в /app
WORKDIR /app

# Копируем файл package.json из хоста внутрь контейнера
COPY package.json /app

# Устанавливаем зависимости Node.js
RUN npm i

# Копируем все остальные файлы из хоста внутрь контейнера
COPY . .

# Устанавливаем переменную среды PORT на значение 8080
ENV PORT 8080

# Открываем порт, на котором будет работать приложение
EXPOSE ${PORT}

# Создаем том для хранения данных внутри контейнера
VOLUME [ "/app/data" ]

# Команда по умолчанию для запуска приложения в режиме разработки
CMD [ "npm", "run", "dev" ]